projects/k6-tool-poc-cat/04-engineering/results/test3-vu-think-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/test3-load-pattern.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m10s max duration (incl. graceful stop):
              * ramp_vus: Up to 10 looping VUs for 40s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
ramp_vus   [   2% ] 01/10 VUs  01.0s/40.0s

running (0m02.0s), 01/10 VUs, 3 complete and 0 interrupted iterations
ramp_vus   [   5% ] 01/10 VUs  02.0s/40.0s

running (0m03.0s), 01/10 VUs, 5 complete and 0 interrupted iterations
ramp_vus   [   7% ] 01/10 VUs  03.0s/40.0s

running (0m04.0s), 01/10 VUs, 8 complete and 0 interrupted iterations
ramp_vus   [  10% ] 01/10 VUs  04.0s/40.0s

running (0m05.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
ramp_vus   [  12% ] 01/10 VUs  05.0s/40.0s

running (0m06.0s), 01/10 VUs, 13 complete and 0 interrupted iterations
ramp_vus   [  15% ] 01/10 VUs  06.0s/40.0s

running (0m07.0s), 01/10 VUs, 15 complete and 0 interrupted iterations
ramp_vus   [  17% ] 01/10 VUs  07.0s/40.0s

running (0m08.0s), 01/10 VUs, 17 complete and 0 interrupted iterations
ramp_vus   [  20% ] 01/10 VUs  08.0s/40.0s

running (0m09.0s), 01/10 VUs, 20 complete and 0 interrupted iterations
ramp_vus   [  22% ] 01/10 VUs  09.0s/40.0s

running (0m10.0s), 01/10 VUs, 22 complete and 0 interrupted iterations
ramp_vus   [  25% ] 01/10 VUs  10.0s/40.0s

running (0m11.0s), 01/10 VUs, 24 complete and 0 interrupted iterations
ramp_vus   [  27% ] 01/10 VUs  11.0s/40.0s

running (0m12.0s), 01/10 VUs, 27 complete and 0 interrupted iterations
ramp_vus   [  30% ] 01/10 VUs  12.0s/40.0s

running (0m13.0s), 02/10 VUs, 29 complete and 0 interrupted iterations
ramp_vus   [  32% ] 02/10 VUs  13.0s/40.0s

running (0m14.0s), 02/10 VUs, 35 complete and 0 interrupted iterations
ramp_vus   [  35% ] 02/10 VUs  14.0s/40.0s

running (0m15.0s), 03/10 VUs, 39 complete and 0 interrupted iterations
ramp_vus   [  37% ] 03/10 VUs  15.0s/40.0s

running (0m16.0s), 03/10 VUs, 46 complete and 0 interrupted iterations
ramp_vus   [  40% ] 03/10 VUs  16.0s/40.0s

running (0m17.0s), 04/10 VUs, 54 complete and 0 interrupted iterations
ramp_vus   [  42% ] 04/10 VUs  17.0s/40.0s

running (0m18.0s), 04/10 VUs, 61 complete and 0 interrupted iterations
ramp_vus   [  45% ] 04/10 VUs  18.0s/40.0s

running (0m19.0s), 05/10 VUs, 71 complete and 0 interrupted iterations
ramp_vus   [  47% ] 05/10 VUs  19.0s/40.0s

running (0m20.0s), 05/10 VUs, 82 complete and 0 interrupted iterations
ramp_vus   [  50% ] 05/10 VUs  20.0s/40.0s

running (0m21.0s), 05/10 VUs, 95 complete and 0 interrupted iterations
ramp_vus   [  52% ] 05/10 VUs  21.0s/40.0s

running (0m22.0s), 06/10 VUs, 108 complete and 0 interrupted iterations
ramp_vus   [  55% ] 06/10 VUs  22.0s/40.0s

running (0m23.0s), 06/10 VUs, 120 complete and 0 interrupted iterations
ramp_vus   [  57% ] 06/10 VUs  23.0s/40.0s

running (0m24.0s), 07/10 VUs, 136 complete and 0 interrupted iterations
ramp_vus   [  60% ] 07/10 VUs  24.0s/40.0s

running (0m25.0s), 07/10 VUs, 152 complete and 0 interrupted iterations
ramp_vus   [  62% ] 07/10 VUs  25.0s/40.0s

running (0m26.0s), 08/10 VUs, 167 complete and 0 interrupted iterations
ramp_vus   [  65% ] 08/10 VUs  26.0s/40.0s

running (0m27.0s), 08/10 VUs, 189 complete and 0 interrupted iterations
ramp_vus   [  67% ] 08/10 VUs  27.0s/40.0s

running (0m28.0s), 09/10 VUs, 205 complete and 0 interrupted iterations
ramp_vus   [  70% ] 09/10 VUs  28.0s/40.0s

running (0m29.0s), 09/10 VUs, 229 complete and 0 interrupted iterations
ramp_vus   [  72% ] 09/10 VUs  29.0s/40.0s

running (0m30.0s), 09/10 VUs, 249 complete and 0 interrupted iterations
ramp_vus   [  75% ] 09/10 VUs  30.0s/40.0s

running (0m31.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
ramp_vus   [  77% ] 10/10 VUs  31.0s/40.0s

running (0m32.0s), 09/10 VUs, 294 complete and 0 interrupted iterations
ramp_vus   [  80% ] 09/10 VUs  32.0s/40.0s

running (0m33.0s), 08/10 VUs, 314 complete and 0 interrupted iterations
ramp_vus   [  82% ] 08/10 VUs  33.0s/40.0s

running (0m34.0s), 07/10 VUs, 336 complete and 0 interrupted iterations
ramp_vus   [  85% ] 07/10 VUs  34.0s/40.0s

running (0m35.0s), 07/10 VUs, 352 complete and 0 interrupted iterations
ramp_vus   [  87% ] 07/10 VUs  35.0s/40.0s

running (0m36.0s), 06/10 VUs, 365 complete and 0 interrupted iterations
ramp_vus   [  90% ] 06/10 VUs  36.0s/40.0s

running (0m37.0s), 05/10 VUs, 380 complete and 0 interrupted iterations
ramp_vus   [  92% ] 05/10 VUs  37.0s/40.0s

running (0m38.0s), 04/10 VUs, 392 complete and 0 interrupted iterations
ramp_vus   [  95% ] 04/10 VUs  38.0s/40.0s

running (0m39.0s), 04/10 VUs, 400 complete and 0 interrupted iterations
ramp_vus   [  97% ] 04/10 VUs  39.0s/40.0s

running (0m40.0s), 03/10 VUs, 408 complete and 0 interrupted iterations
ramp_vus   [ 100% ] 03/10 VUs  40.0s/40.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<800' p(95)=253.21ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 413     10.223362/s
    checks_succeeded...: 100.00% 413 out of 413
    checks_failed......: 0.00%   0 out of 413

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=108.96ms min=5.03ms   med=156.84ms max=263.53ms p(90)=189.98ms p(95)=253.21ms
      { expected_response:true }...: avg=108.96ms min=5.03ms   med=156.84ms max=263.53ms p(90)=189.98ms p(95)=253.21ms
    http_req_failed................: 0.00%  0 out of 826
    http_reqs......................: 826    20.446724/s

    EXECUTION
    iteration_duration.............: avg=429.61ms min=379.68ms med=394.95ms max=979.8ms  p(90)=465.09ms p(95)=471.64ms
    iterations.....................: 413    10.223362/s
    vus............................: 3      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 1.6 MB 40 kB/s
    data_sent......................: 72 kB  1.8 kB/s



running (0m40.4s), 00/10 VUs, 413 complete and 0 interrupted iterations
ramp_vus ✓ [ 100% ] 00/10 VUs  40s